IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/UART3_UART3.xml
	<register id="UART3_EBLR" acronym="UART3_EBLR" offset="0x48" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="EBLR" width="8" begin="7" end="0" resetval="0x0" description="IR-IRDA mode: This register allows to define up to 176 xBOFs, the maximum required by IrDA specification.IR-CIR mode: This register specifies the number of consecutive zeros to be received before generating the RX_STOP interrupt [IIR[2]].0x00: feature disabled.0x01: generate RX_STOP interrupt after receiving one zero bit....0xFF: generate RX_STOP interrupt after receiving 255 zero bits." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="UART3_MVR" acronym="UART3_MVR" offset="0x50" width="32" description="">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="Scheme revision number of module" range="31 - 30" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="2" begin="29" end="28" resetval="0x0" description="Not Defined" range="29 - 28" rwaccess="RO"/> 
		<bitfield id="FUNC" width="12" begin="27" end="16" resetval="0x1858" description="Function revision number of module" range="27 - 16" rwaccess="RO"/> 
		<bitfield id="RTL" width="5" begin="15" end="11" resetval="0x8" description="Rtl revision number of module" range="15 - 11" rwaccess="RO"/> 
		<bitfield id="MAJOR" width="3" begin="10" end="8" resetval="0x6" description="Major revision number of the module." range="10 - 8" rwaccess="RO"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom revision number of the module." range="7 - 6" rwaccess="RO"/> 
		<bitfield id="MINOR" width="6" begin="5" end="0" resetval="0x3" description="Minor revision number of the module." range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="UART3_SYSC" acronym="UART3_SYSC" offset="0x54" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="3" begin="7" end="5" resetval="0x0" description="Not Defined" range="7 - 5" rwaccess="RO"/> 
		<bitfield id="IDLEMODE" width="2" begin="4" end="3" resetval="0x0" description="POWER MANAGEMENT REQ/ACK CONTROLREF: OCP DESIGN GUIDELINES VERSION 1.1    0x0   |   IDLEMODE_VALUE_0Force idle. An idle request is acknowledged unconditionally      0x1   |   IDLEMODE_VALUE_1No-idle. An idle request is never acknowledged.      0x2   |   IDLEMODE_VALUE_2Smart idle. Acknowledgement to an idle request is given based in the internal activity of the module.      0x3   |   IDLEMODE_VALUE_3reserved  " range="4 - 3" rwaccess="RW"/> 
		<bitfield id="ENAWAKEUP" width="1" begin="2" end="2" resetval="0x0" description="WAKE UP FEATURE CONTROL    0   |   ENAWAKEUP_VALUE_0Wake up is disabled      1   |   ENAWAKEUP_VALUE_1Wake up capability is enabled  " range="2" rwaccess="RW"/> 
		<bitfield id="SOFTRESET" width="1" begin="1" end="1" resetval="0x0" description="Software reset. Set this bit to 1 to trigger a module reset. This bit is automatically reset by the hardware. During reads it always returns a 0.    Write0   |   SOFTRESET_VALUE_0Normal mode      Write1   |   SOFTRESET_VALUE_1The module is reset  " range="1" rwaccess="WO"/> 
		<bitfield id="AUTOIDLE" width="1" begin="0" end="0" resetval="0x0" description="Internal OCP clock gating strategy    0   |   AUTOIDLE_VALUE_0Clock is running      1   |   AUTOIDLE_VALUE_1Automatic OCP clock gating strategy is applied, based on the OCP interface activity  " range="0" rwaccess="RW"/>
	</register>
	<register id="UART3_SYSS" acronym="UART3_SYSS" offset="0x58" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="7" begin="7" end="1" resetval="0x0" description="Not Defined" range="7 - 1" rwaccess="RO"/> 
		<bitfield id="RESETDONE" width="1" begin="0" end="0" resetval="0x0" description="Internal Reset Monitoring    Read0   |   RESETDONE_VALUE_0Internal Module Reset is ongoing      Read1   |   RESETDONE_VALUE_1Reset completed  " range="0" rwaccess="RO"/>
	</register>
	<register id="UART3_WER" acronym="UART3_WER" offset="0x5C" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="EVENT_7_TX_WAKEUP_EN" width="1" begin="7" end="7" resetval="0x1" description="Not Defined    0   |   EVENT_7_TX_WAKEUP_EN_VALUE_0Event is not allowed to wake up the system      1   |   EVENT_7_TX_WAKEUP_EN_VALUE_1EVENT CAN WAKE UP THE SYSTEM: Event can be: THR_IT or TX_DMA request and/or TX_SATUS_IT  " range="7" rwaccess="RW"/> 
		<bitfield id="EVENT_6_RECEIVER_LINE_STATUS_INTERRUPT" width="1" begin="6" end="6" resetval="0x1" description="Not Defined    0   |   EVENT_6_RECEIVER_LINE_STATUS_INTERRUPT_VALUE_0Event is not allowed to wake up the system      1   |   EVENT_6_RECEIVER_LINE_STATUS_INTERRUPT_VALUE_1Event can wake up the system  " range="6" rwaccess="RW"/> 
		<bitfield id="EVENT_5_RHR_INTERRUPT" width="1" begin="5" end="5" resetval="0x1" description="Not Defined    0   |   EVENT_5_RHR_INTERRUPT_VALUE_0Event is not allowed to wake up the system      1   |   EVENT_5_RHR_INTERRUPT_VALUE_1Event can wake up the system  " range="5" rwaccess="RW"/> 
		<bitfield id="EVENT_4_RX_ACTIVITY" width="1" begin="4" end="4" resetval="0x1" description="Not Defined    0   |   EVENT_4_RX_ACTIVITY_VALUE_0Event is not allowed to wake up the system      1   |   EVENT_4_RX_ACTIVITY_VALUE_1Event can wake up the system  " range="4" rwaccess="RW"/> 
		<bitfield id="EVENT_3_DCD_CD_ACTIVITY" width="1" begin="3" end="3" resetval="0x1" description="Not Defined    0   |   EVENT_3_DCD_CD_ACTIVITY_VALUE_0Event is not allowed to wake up the system      1   |   EVENT_3_DCD_CD_ACTIVITY_VALUE_1Event can wake up the system  " range="3" rwaccess="RW"/> 
		<bitfield id="EVENT_2_RI_ACTIVITY" width="1" begin="2" end="2" resetval="0x1" description="Not Defined    0   |   EVENT_2_RI_ACTIVITY_VALUE_0Event is not allowed to wake up the system      1   |   EVENT_2_RI_ACTIVITY_VALUE_1Event can wake up the system  " range="2" rwaccess="RW"/> 
		<bitfield id="EVENT_1_DSR_ACTIVITY" width="1" begin="1" end="1" resetval="0x1" description="Not Defined    0   |   EVENT_1_DSR_ACTIVITY_VALUE_0Event is not allowed to wake up the system      1   |   EVENT_1_DSR_ACTIVITY_VALUE_1Event can wake up the system  " range="1" rwaccess="RW"/> 
		<bitfield id="EVENT_0_CTS_ACTIVITY" width="1" begin="0" end="0" resetval="0x1" description="Not Defined    0   |   EVENT_0_CTS_ACTIVITY_VALUE_0Event is not allowed to wake up the system      1   |   EVENT_0_CTS_ACTIVITY_VALUE_1Event can wake up the system  " range="0" rwaccess="RW"/>
	</register>
	<register id="UART3_CFPS" acronym="UART3_CFPS" offset="0x60" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="CFPS" width="8" begin="7" end="0" resetval="0x105" description="System clock frequency prescaler at [12x multiple]. Examples for CFPS values are given in the table below.Target Freq [KHz] CFPS [decimal] Actual Freq[KHz] 30   133  30.08 32.75   122  32.79 36   111  36.04 36.7   109  36.69 38*   105  38.1 40   100  40 56.8   70  57.14* configured at reset to this valueNote: CFPS = 0 is not supported." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="UART3_RXFIFO_LVL" acronym="UART3_RXFIFO_LVL" offset="0x64" width="32" description="">
		<bitfield id="RESERVED24" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RXFIFO_LVL" width="8" begin="7" end="0" resetval="0x0" description="Not Defined" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="UART3_TXFIFO_LVL" acronym="UART3_TXFIFO_LVL" offset="0x68" width="32" description="">
		<bitfield id="RESERVED24" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="TXFIFO_LVL" width="8" begin="7" end="0" resetval="0x0" description="Not Defined" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="UART3_IER2" acronym="UART3_IER2" offset="0x6C" width="32" description="">
		<bitfield id="RESERVED1" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="5" begin="7" end="3" resetval="0x0" description="Not Defined" range="7 - 3" rwaccess="RO"/> 
		<bitfield id="RHR_IT_DIS" width="1" begin="2" end="2" resetval="0x0" description="Not Defined    0   |   RHR_IT_DIS_VALUE_0Enables the RHR interrupt.      1   |   RHR_IT_DIS_VALUE_1Disables the RHR interrupt.  " range="2" rwaccess="RW"/> 
		<bitfield id="EN_TXFIFO_EMPTY" width="1" begin="1" end="1" resetval="0x0" description="Enables[1]/DISABLES[00 EN_TXFIFO_EMPTY interrupt." range="1" rwaccess="RW"/> 
		<bitfield id="EN_RXFIFO_EMPTY" width="1" begin="0" end="0" resetval="0x0" description="Enables[1]/disables[0] EN_RXFIFO_EMPTY interrupt." range="0" rwaccess="RW"/>
	</register>
	<register id="UART3_ISR2" acronym="UART3_ISR2" offset="0x70" width="32" description="">
		<bitfield id="RESERVED1" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="6" begin="7" end="2" resetval="0x0" description="Not Defined" range="7 - 2" rwaccess="RO"/> 
		<bitfield id="TXFIFO_EMPTY_STS" width="1" begin="1" end="1" resetval="0x1" description="TXFIFO interrupt pending    0   |   TXFIFO_EMPTY_STS_VALUE_0TXFIFO_EMPTY interrupt not pending.      1   |   TXFIFO_EMPTY_STS_VALUE_1TXFIFO_EMPTY interrupt pending.  " range="1" rwaccess="RW"/> 
		<bitfield id="RXFIFO_EMPTY_STS" width="1" begin="0" end="0" resetval="0x1" description="RXFIFO interrupt pending    0   |   RXFIFO_EMPTY_STS_VALUE_0RXFIFO_EMPTY interrupt not pending.      1   |   RXFIFO_EMPTY_STS_VALUE_1RXFIFO_EMPTY interrupt pending.  " range="0" rwaccess="RW"/>
	</register>
